# vim:ft=sh
##
## Taps
##
tap "clojure/tools"
tap "crystal-ameba/ameba"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
brew "brew-cask-completion"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "microsoft/git"
tap "oven-sh/bun"

##
## Languages & Programming tools
##
brew "deno"                      # js runtime
brew "bun" # js runtime
brew "clojure/tools/clojure"     # clojure
brew "go"                        # golang
brew "luarocks"                  # lua
brew "python@3.11"               # brew python
brew "opam"                      # ocaml
brew "asdf"                      # nodejs, elixir, crystal, erlang
brew "crystal-ameba/ameba/ameba" # crystal linter
cask "temurin17"                 # java
brew "odin"                      # odin lang
brew "perl"                      # brew perl
brew "gcc"                       # C compiler
brew "llvm"                      # C compiler
brew "scala"                     # scala
brew "php"                       # php + service
brew "cmake"                     # cpp build system

##
## Terminal
##
brew "exa"       # ls replacement
brew "fastfetch" # neofetch alternative
brew "fish"      # shell
brew "starship"  # prompt
brew "gum"       # terminal scripts
brew "tldr"      # shorter manpages

##
## Files
##
# editing & viewing
brew "neovim"    # text editor
brew "bat"       # cat replacement
brew "glow"      # markdown previewer
brew "coreutils" # GNU utils

# management
brew "jesseduffield/lazygit/lazygit" # terminal git client
brew "zoxide"                        # cd replacement
brew "aria2"                         # download manager
brew "wakatime-cli"                  # time tracking
brew "yadm"                          # dotfiles management
brew "parallel"                      # parallelisation
brew "entr"                          # watch files for changes
brew "trash"                         # move files to trash
brew "xdg-ninja"                     # clean up $HOME dir

# search
brew "fd"      # find replacement
brew "fzf"     # terminal fuzzy finder
brew "lf"      # terminal file manager
brew "ripgrep" # grep replacement
brew "scc"     # count lines of code

# archives
brew "lrzip"
brew "xz"
brew "brotli"

# media
brew "yt-dlp" # youtube-dl replacement
brew "ffmpeg" # media converter

# git
brew "gh"                                        # github cli
brew "git"                                       # brew git
brew "git-delta"                                 # TODO
cask "microsoft/git/git-credential-manager-core" # gh authentication
brew "gnupg"                                     # gh commit signing

##
## Manual requirements
##
# crpreview
brew "imagemagick" # image manipulation
brew "chafa"       # image preview
brew "poppler"     # pdf to image
brew "libarchive"  # archive parser
brew "exiftool"    # TODO

# rsync
cask "macfuse" # Mount external filesystems

# neovim
brew "gnu-sed" # nvim-spectre

# asdf erlang
brew "libxslt"
brew "fop"
brew "wxwidgets"

##
## Other
##

brew "folderify"
brew "mkvtoolnix"
brew "bitwarden-cli"
