# vim:ft=sh
##
## Taps
##
tap "clojure/tools"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "microsoft/git"
tap "veelenga/tap"

##
## Languages
##
brew "crystal"               # crystal lang
brew "veelenga/tap/ameba"    # crystal linter
brew "deno"                  # ts & js runtime
brew "elixir"                # elixir lang
cask "livebook"              # elixir notebook
brew "gleam"                 # gleam lang
brew "clojure/tools/clojure" # clojure
brew "go"                    # golang
brew "luarocks"              # lua
brew "python@3.11"           # brew python
brew "opam"                  # ocaml
brew "asdf"                  # nodejs
brew "rust"                  # rustup
cask "temurin17"             # java
brew "odin"                  # odin lang

##
## Terminal
##
cask "iterm2"    # terminal
brew "exa"       # ls replacement
brew "fastfetch" # neofetch alternative
brew "fish"      # shell
brew "starship"  # prompt
brew "gum"       # terminal scripts
brew "tldr"      # shorter manpages
brew "aichat"    # openai in the terminal

##
## Files
##
# editing & viewing
brew "neovim"             # text editor
cask "macvim"             # gui vim client
cask "visual-studio-code" # code editor
brew "bat"                # cat replacement
brew "glow"               # markdown previewer
cask "basictex"           # Small LaTeX
cask "qlvideo"            # QuickLook for Videos
cask "qlmarkdown"         # QuickLook for Markdown

# management
brew "jesseduffield/lazygit/lazygit" # terminal git client
brew "zoxide"                        # cd replacement
brew "aria2"                         # download manager
brew "wakatime-cli"                  # time tracking
brew "yadm"                          # dotfiles management
brew "parallel"                      # parallelisation
brew "entr"                          # watch files for changes
brew "trash"                         # move files to trash
brew "xdg-ninja"                     # clean up $HOME dir

# search
brew "fd"      # find replacement
brew "fzf"     # terminal fuzzy finder
brew "lf"      # terminal file manager
brew "ripgrep" # grep replacement

# archives
brew "lrzip"
brew "xz"
brew "brotli"

# media
brew "yt-dlp" # youtube-dl replacement
brew "ffmpeg" # media converter

# git
brew "gh"                                        # github cli
brew "git"                                       # brew git
brew "git-delta"                                 # TODO
cask "microsoft/git/git-credential-manager-core" # gh authentication
brew "gnupg"                                     # gh commit signing

##
## Manual requirements
##
# crpreview
brew "imagemagick" # image manipulation
brew "chafa"       # image preview
brew "poppler"     # pdf to image
brew "libarchive"  # archive parser
brew "exiftool"    # TODO

# rsync
cask "macfuse" # Mount external filesystems

# neovim
brew "gnu-sed" # nvim-spectre

##
## Other
##
brew "gcc"              # compiler
brew "coreutils"        # misc utils
brew "mono"             # unity vscode support
cask "tempbox"          # Termporary Mail Wrapper
cask "eloston-chromium" # browser for testing
cask "microsoft-teams"  # MS Teams
cask "raycast"          # spotlight replacement
cask "discord"
cask "rectangle"
cask "alt-tab"
cask "obsidian"
cask "spotify"
cask "cron"
cask "arc"
cask "reaper"
cask "hyperkey"
cask "suspicious-package"
cask "transmission"
cask "transmission-remote-gui"
cask "logseq"
cask "electrum"
cask "Zotero"

##
## Disabled
##
# brew "bat-extras" # extra functions for bat
